// --------------------------------------- Типы данных --------------------------------------------
// String - 'cool'
// Number - 123, 2.12
// Boolean - true, false

// null
// undefined

// BigInt - 12312312312312312321312n

// Symbol

// Object

// ''
// ""
// `` - backtiks

// --------------------------------------- Переменные --------------------------------------------

// let user = 'Ihor';
// let favoriteNumber = 100;
// const isOnline = false;

// --------------------------------------- Операторы --------------------------------------------

// строковые       +
// математические  +, -, *, /, %
// логические      !, ||, &&

// let num = 10;

// console.log(num);


// const song = 'don\'t worry\nbe\nhuggies' // нужно экранировать спец символы
// const song1 = "don't worry\nbe\nhuggies" // не нужно экранировать символы
// console.log(song);

